app/controllers/admins_controller.rb

  def show
    @admin = Admin.find(session[:admin_id])
---
SELECT "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def edit
    @admin = Admin.find(session[:admin_id])
---
SELECT "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
    @admin = Admin.find(session[:admin_id])
    if @admin.update(admin_params)
---
SELECT "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "admins" SET "email" = ?, "updated_at" = ? WHERE "admins"."id" = ?  [["email", "test@gmail.com"], ["updated_at", "2023-09-28 09:50:35.082737"], ["id", 3]]

  def destroy
    @admin.destroy
---
DELETE FROM "admins" WHERE "admins"."id" = ?  [["id", 2]]