app/controllers/admin_dashboard_controller.rb

  def index
    if session[:admin_id] && Admin.exists?(session[:admin_id])
      @admin = Admin.find(session[:admin_id])
---
SELECT "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]