app/controllers/passengers_controller.rb

SELECT "passengers".* FROM "passengers"
---
  def index
    if session[:role] == "user"
      redirect_to passenger_dashboard_index_path
    end
    @passengers = Passenger.all

INSERT INTO "passengers" ("name", "email", "password", "phone_number", "address", "credit_card", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @passenger = Passenger.new(passenger_params)

    respond_to do |format|
      if @passenger.save

SELECT "passengers".* FROM "passengers" WHERE "passengers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_passenger
      if session[:role] == "user"
        if session[:user_id] != params[:id].to_i
          redirect_to passenger_dashboard_index_path
          return
        end
      end
      @passenger = Passenger.find(params[:id])