app/controllers/passenger_dashboard_controller.rb

SELECT "passengers".* FROM "passengers" WHERE "passengers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def index
    @passenger = Passenger.find(session[:user_id])