app/controllers/reviews_controller.rb

SELECT "name" FROM "reviews" LEFT OUTER JOIN "passengers" ON "passengers"."id" = "reviews"."passenger_id"
SELECT "train_number" FROM "reviews" LEFT OUTER JOIN "trains" ON "trains"."id" = "reviews"."train_id"
SELECT "reviews".* FROM "reviews"
---
  def index
    @users = Review.includes(:passenger).pluck(:name)
    @trains = Review.includes(:train).pluck(:train_number)

    @reviews = Review.includes(:passenger, :train).all