app/controllers/sessions_controller.rb

  def create
    admin = Admin.find_by(username: params[:username])
---
SELECT "admins".* FROM "admins" WHERE "admins"."username" = ? LIMIT ?  [["username", "ff"], ["LIMIT", 1]]