app/controllers/tickets_controller.rb

  def index
    if session[:role] == "user"
      @tickets = Ticket.includes(:train).where(passenger_id: session[:user_id])
    else
      @tickets = Ticket.includes(:train).all
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."passenger_id" = ?  [["passenger_id", 3]]
SELECT "tickets".* FROM "tickets"

  def create
    @ticket = Ticket.new(ticket_params)
    @train = Train.find(@ticket.train_id)
    if @train.number_of_seats_left < 0
      format.html { redirect_to trains_url, notice: "No more seats left" }
      format.json { head :no_content }
      return
    end
    respond_to do |format|
      if @ticket.save
---
INSERT INTO "tickets" ("confirmation_number", "created_at", "updated_at") VALUES (?, ?, ?)  [["confirmation_number", 1111], ["created_at", "2023-09-28 10:50:56.467828"], ["updated_at", "2023-09-28 10:50:56.467828"]]

    def set_ticket
      if session[:role] == "user"
        @ticket = Ticket.find_by(id: params[:id])
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]