app/controllers/trains_controller.rb

  def index
    @departure_stations = Train.select(:departure_station).distinct.pluck(:departure_station)
    @termination_stations = Train.select(:termination_station).distinct.pluck(:termination_station)
    @departure_dates = Train.select(:departure_date).distinct.pluck(:departure_date)
    @ratings = ["Yes"]
    @upcoming = ["Yes"]
    @searchf = Train.pluck(:train_number)

    @trains = Train.all
    @trains = @trains.where(departure_station: params[:departure_station]) if params[:departure_station].present?
    @trains = @trains.where(termination_station: params[:termination_station]) if params[:termination_station].present?
---
SELECT DISTINCT "trains"."departure_station" FROM "trains"
SELECT DISTINCT "trains"."termination_station" FROM "trains"
SELECT DISTINCT "trains"."departure_date" FROM "trains"
SELECT "trains"."train_number" FROM "trains"
SELECT "trains".* FROM "trains"
SELECT "trains".* FROM "trains" WHERE "trains"."departure_station" = ?  [["departure_station", "raleigh"]]
SELECT "trains".* FROM "trains" WHERE "trains"."termination_station" = ?  [["termination_station", "Greensboro"]]

  def create
    @train = Train.new(train_params)

    respond_to do |format|
      if @train.save
---
INSERT INTO "trains" ("train_number", "departure_station", "termination_station", "departure_date", "departure_time", "arrival_date", "arrival_time", "ticket_price", "train_capacity", "number_of_seats_left", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @train.update(train_params)
---
UPDATE "trains" SET "termination_station" = ?, "updated_at" = ? WHERE "trains"."id" = ?  [["termination_station", "Greensboro"], ["updated_at", "2023-09-28 10:41:57.579593"], ["id", 1]]