app/controllers/trains_controller.rb

  def create
    @train = Train.new(train_params)

    respond_to do |format|
      if @train.save
---
INSERT INTO "trains" ("train_number", "departure_station", "termination_station", "departure_date", "departure_time", "arrival_date", "arrival_time", "ticket_price", "train_capacity", "number_of_seats_left", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)