app/controllers/users_controller.rb

  def create
    @user = Passenger.find_by(email: params[:email])
---
SELECT "passengers".* FROM "passengers" WHERE "passengers"."email" = ? LIMIT ?  [["email", "a@gmail.com"], ["LIMIT", 1]]